# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Improved YOLO11 with ASFF, BiFPN, and CBAM for enhanced object detection
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Improved YOLO11n head
head:
  # Upsampling path - P5 to P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12: cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13
  
  # Upsampling path - P4 to P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15: cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16: P3/8-small
  
  # Downsampling path - P3 to P4
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18: cat with P4 features
  - [-1, 2, C3k2, [512, False]] # 19: P4/16-medium
  
  # Downsampling path - P4 to P5
  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21: cat with P5 features
  - [-1, 2, C3k2, [1024, True]] # 22: P5/32-large
  
  # Apply CBAM modules to enhance feature maps
  - [16, 1, CBAM, [256]] # 23: Add CBAM to P3 features
  - [19, 1, CBAM, [512]] # 24: Add CBAM to P4 features
  - [22, 1, CBAM, [1024]] # 25: Add CBAM to P5 features
  
  # Detection head for multi-scale feature detection
  - [[23, 24, 25], 1, Detect, [nc]] # 26: Detect with CBAM-enhanced features
