# Backbone with CBAM inserted after each major stage
backbone:
  - [-1, 1, Conv,   [64,    3, 2]]      # 0-P1/2
  - [-1, 1, Conv,   [128,   3, 2]]      # 1-P2/4
  - [-1, 2, C3k2,   [256, False, 0.25]]
  - [-1, 1, CBAM,   [256, 7]]              # CBAM on P2
  - [-1, 1, Conv,   [256,   3, 2]]      # 3-P3/8
  - [-1, 2, C3k2,   [512, False, 0.25]]
  - [-1, 1, CBAM,   [512, 7]]              # CBAM on P3
  - [-1, 1, Conv,   [512,   3, 2]]      # 5-P4/16
  - [-1, 4, A2C2f,  [512, True, 4]]
  - [-1, 1, CBAM,   [512, 7]]              # CBAM on P4
  - [-1, 1, Conv,   [1024,  3, 2]]      # 7-P5/32
  - [-1, 4, A2C2f,  [1024, True, 1]]
  - [-1, 1, CBAM,   [1024, 7]]             # CBAM on P5

# Head with CBAM optionally between feature merges
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]           # cat backbone P4 with P5
  - [-1, 2, A2C2f,  [512, False, -1]]
  - [-1, 1, CBAM,   [512, 7]]              # CBAM after P5-P4 merge

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P3 with P4
  - [-1, 2, A2C2f,  [256, False, -1]]
  - [-1, 1, CBAM,   [256, 7]]              # CBAM after P4-P3 merge

  - [-1, 1, Conv,   [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P5 with P4 merge
  - [-1, 2, A2C2f,  [512, False, -1]]
  - [-1, 1, CBAM,   [512, 7]]              # CBAM after P4 up-down merge

  - [-1, 1, Conv,   [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]           # cat head P5
  - [-1, 2, C3k2,   [1024, True]]       # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]     # Detect(P3, P4, P5)
